Repository: mathiastornblom/Event-QR-Scanner
Catalog: Event QR Scanner/Resources/Localizable.xcstrings
Source language: en
Languages: sv

source: About
sv: Om

# about_title
source: About
sv: Om

# acknowledgments
source: Special thanks to everyone who supported and contributed to the development of this app.
sv: Speciellt tack till alla som stöttat och bidragit till utvecklingen av denna app.

# app_description
source: The QR Scanner App is designed for easy and efficient QR code scanning at sports events. Featuring quick scan capabilities, information retrieval, and seamless integration with event management systems.
sv: QR Scanner App är designad för enkel och effektiv QR-kodsskanning vid sportevenemang. Appen erbjuder snabb skanningsförmåga, informationsåtervinning och sömlös integration med evenemangshanteringssystem.

# app_name
source: Event QR Scanner App
sv: Event QR Skanner App

source: Cancel
sv: Avbryt

source: Change event
sv: Byt event

# check_selected_event_try_again
source: Check selected event and try again.
sv: Kontrollera valt event och försök igen.

source: Clear
sv: Rensa

source: Clear all
sv: Rensa allt

source: Clear event
sv: Rensa event

source: Clear station
sv: Rensa station

# club_format
source: Club: %@
sv: Klubb: %@

source: Close
sv: Stäng

# code_format
source: Code: %@
sv: Kod: %@

source: Code not found.
sv: Koden hittades inte.

# confirm_clear_all_message
source: This will remove all scans from all events.
sv: Detta rensar alla skanningar från alla event.

# confirm_clear_all_title
source: Clear all history?
sv: Rensa all historik?

# confirm_clear_event_message
source: This will remove all scans for the selected event.
sv: Detta rensar alla skanningar för valt event.

# confirm_clear_station_message
source: This will remove all scans for the selected station.
sv: Detta rensar alla skanningar för vald station.

# confirm_clear_title
source: Clear history?
sv: Rensa historik?

# contact_info
source: Contact me: mathias@tornbloms.net
sv: Kontakta mig på: mathias@tornbloms.net

# debug_api_key_status_format
source: API key status: %@
sv: API-nyckelstatus: %@

# debug_fetch_status_format
source: Fetch status: %@
sv: Hämtningsstatus: %@

# debug_last_error_format
source: Last error: %@
sv: Senaste fel: %@

# debug_last_fetch_format
source: Last fetch: %@
sv: Senaste hämtning: %@

# debug_requested_event_id_format
source: Requested event id: %@
sv: Begärt event-id: %@

# debug_selected_event_id_format
source: Selected event id: %@
sv: Valt event-id: %@

# debug_selected_event_name_format
source: Selected event name: %@
sv: Valt eventnamn: %@

# debug_stations_loaded_format
source: Stations loaded: %lld
sv: Stationer laddade: %lld

# debug_visible_rows_format
source: Visible rows: %lld
sv: Synliga rader: %lld

source: Denied.
sv: Nekad.

source: Denied: code not found.
sv: Nekad: koden finns inte.

# denied_no_remaining
source: Denied: no quota remaining.
sv: Nekad: ingen kvot kvar.

# denied_outside_time_window
source: Denied: outside allowed time window.
sv: Nekad: utanför tillåtet tidsfönster.

# denied_reason_format
source: Denied: %@.
sv: Nekad: %@.

source: Developed by:
sv: Utvecklad av:

source: Done
sv: Klar

# error_cannot_add_metadata_output
source: Error: Can't add metadata output error
sv: Fel: Kan inte skapa videoingång.

# error_cannot_add_video_input
source: Error: Can't add video input.
sv: Fel: Kan inte lägga till videoingång.

# error_no_video_device
source: Error: No video device found.
sv: Fel: Ingen videoutrustning hittades.

# error_unable_to_create_video_input
source: Error: Unable to create video input error
sv: Fel: Kan inte lägga till metadatautgång.

# event_date_format
source: Dates: %@
sv: Datum: %@

source: Event logo
sv: Eventlogotyp

# event_logo_format
source: %@ logo
sv: %@ logotyp

source: Event QR Scanner
sv: Event QR-skanner

# events_fetch_failed
source: Could not fetch events. Check API key or network.
sv: Kunde inte hämta event. Kontrollera API-nyckel eller nätverk.

source: History
sv: Historik

# history_empty_message
source: Scans will appear here.
sv: Skanningar visas här.

# history_requires_event
source: Select an event to view scan history.
sv: Välj ett event för att se skanningshistorik.

source: Holder:
sv: Innehavare:

# last_updated_format
source: Last updated: %@
sv: Senast uppdaterad: %@

source: Loading...
sv: Laddar...

source: Loading stations...
sv: Hämtar stationer...

# lookup_action
source: Lookup
sv: Sök

source: Lookup failed
sv: Uppslag misslyckades

# lookup_http_error_format
source: HTTP error %lld.
sv: HTTP-fel %lld.

# lookup_placeholder
source: Enter code
sv: Ange kod

# lookup_scan_instruction
source: Scan a QR code to see details and rights.
sv: Skanna en QR-kod för att se detaljer och rättigheter.

# lookup_scan_prompt
source: Scan a code
sv: Skanna en kod

# lookup_tab
source: Lookup
sv: Uppslag

# lookup_title
source: Lookup
sv: Uppslag

source: Message:
sv: Meddelande:

source: Next
sv: Nästa

source: No date info
sv: Ingen datuminformation

source: No event selected
sv: Inget event valt

source: No events found.
sv: Inga event hittades.

# no_history
source: No scans yet.
sv: Inga skanningar ännu.

source: No station selected
sv: Ingen station vald

source: No stations found
sv: Inga stationer hittades

source: None
sv: Ingen

source: None selected
sv: Ingen vald

source: Open settings
sv: Öppna inställningar

source: Please select a scanning station.
sv: Välj en skanningsstation

source: QR Code Data:
sv: QR-kodsdata:

source: QR scanner view
sv: QR-skanner

source: Refresh
sv: Uppdatera

source: Refresh Events
sv: Uppdatera event

source: Refresh Stations
sv: Uppdatera stationer

# remaining_after_scan_format
source: Remaining after scan: %lld
sv: Kvar efter scan: %lld

# remaining_selected_station_format
source: Remaining in selected station: %lld
sv: Kvar i vald station: %lld

# rights_title
source: Rights
sv: Rättigheter

# role_format
source: Role: %@
sv: Roll: %@

source: Scan
sv: Skanna

# scan_delay_seconds
source: Delay (Seconds):
sv: Fördröjning (Sekunder):

# scan_denied_title
source: Denied
sv: Nekad

# scan_error_backend
source: Server error. Try again.
sv: Serverfel. Försök igen.

# scan_error_invalid_response
source: Invalid server response.
sv: Ogiltigt serversvar.

# scan_error_invalid_url
source: Invalid server configuration.
sv: Ogiltig serverkonfiguration.

# scan_error_network
source: Cannot reach server. Check network.
sv: Kan inte nå servern. Kontrollera nätverk.

# scan_error_title
source: Error
sv: Fel

# scan_error_unauthorized
source: Unauthorized. Check API key.
sv: Obehörig. Kontrollera API-nyckel.

# scan_error_unknown
source: Unknown error. Try again.
sv: Okänt fel. Försök igen.

# scan_ok_message
source: Scan registered.
sv: Skanning registrerad.

# scan_ok_title
source: Approved
sv: Godkänd

source: Scan QR
sv: Skanna en QR kod

source: Scan Settings
sv: Skanningsinställningar

source: Scanning at:
sv: Skannar vid:

source: Scanning Station
sv: Välj Skanningsstation

source: Scans Left:
sv: Återstående skanningar:

source: Select
sv: Välj

source: Select a Station
sv: Välj en station

source: Select Event
sv: Välj envent

# select_event_first
source: Select an event first.
sv: Välj ett event först.

source: Select Scanning Station
sv: Välj skanningsstation

source: Select Station
sv: Välj station

# selected_station_format
source: Selected station: %@
sv: Vald station: %@

source: Settings
sv: Inställningar

# station_date_format
source: Valid: %@
sv: Giltig: %@

# stations_fetch_failed
source: Could not fetch stations. Try again.
sv: Kunde inte hämta stationer. Försök igen.

# stations_fetch_failed_format
source: Details: %@
sv: Detaljer: %@

source: Stations for code
sv: Stationer för kod

# team_format
source: Team: %@
sv: Lag: %@

source: Toggle flashlight
sv: Slå på/av ficklampan

# total_only_format
source: Total %lld
sv: Totalt %lld

source: Unlimited
sv: Obegränsad

# usage_title
source: Used
sv: Använd

# used_count_format
source: Used %lld times
sv: Använd %lld gånger

# used_station_format
source: Used station: %@
sv: Använd station: %@

# valid_from_format
source: Valid from %@
sv: Giltig från %@

# valid_to_format
source: Valid to %@
sv: Giltig till %@
